---
title: FabricationUtils
classe: Autodesk.Revit.DB.Fabrication.FabricationUtils
namespace: Autodesk.Revit.DB.Fabrication
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# FabricationUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Void ExportToPCF(Document, IList<ElementId>, String)` | `FabricationUtils.ExportToPCF(document, ids, filename)` | Void |
| `Boolean ValidateConnectivity(Document, Connector, Connector)` | `FabricationUtils.ValidateConnectivity(document, connector1, connector2)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```